#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//int main()
//{
//	int a = 20;
//	int b = -10;
//	return 0;
//}


//int check_sys()
//{
//	int i = 1;
//	return *(char*)&i;
//
//}
//int main()
//{
//	if (1 == check_sys())
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//2.
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}
//-1 整数
//10000000000000000000000000000001-原码
//11111111111111111111111111111110-反码
//11111111111111111111111111111111-补码
//32bit
//char a = -1
//发生截断
//8bit
//11111111-实际内存存储
//a=%d-打印整型
//整形提升—有符号数高位按符号数提升，无符号数高位补0
//11111111111111111111111111111111-补码
//11111111111111111111111111111110-反码
//10000000000000000000000000000001-原码
//%d认为内存是有符号数
//-1

//unsigned char c=-1;
//11111111
//c=%d-打印整形
//unsigned char是无符号数，整形提升高位补0
//00000000000000000000000011111111
//%d认为是内存是有符号数，正数，原、反、补码相同
//255


//3.
//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//	return 0;
//}
//-128
//10000000000000000000000010000000-原码
//11111111111111111111111101111111-反码
//11111111111111111111111110000000-补码
//char a=-128
//10000000-char a
//%u-无符号整数
//整形提升—有符号数高位按符号数提升，无符号数高位补0
//11111111111111111111111110000000-补码
//%u-认为内存里是无符号数，以无符号形式来解析内存里的值
//原码、反码、补码相同
//4,294,967,168


//4.
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	return 0;
//}
//
//128
//00000000000000000000000010000000-原码
//00000000000000000000000010000000-反码
//00000000000000000000000010000000-补码
//char a=128
//10000000-char a
//%u-无符号整数
//整形提升—有符号数高位按符号数提升，无符号数高位补0
//11111111111111111111111110000000-补码
//%u-认为内存里是无符号数，以无符号形式来解析内存里的值
//原码、反码、补码相同
//4,294,967,168


//5.
//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	return 0;
//}
//int i=-20;
//10000000000000000000000000010100-原码
//11111111111111111111111111101011-反码
//11111111111111111111111111101100-补码
//unsigned int j=10
//00000000000000000000000000001010
//i+j
//11111111111111111111111111110110-补码
//11111111111111111111111111110101-反码
//10000000000000000000000000001010-原码
//-10



//6.
//#include<windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(1000);
//	}
//	return 0;
//}
//unsigned int i是无符号整型，i恒≥0
//-1放到unsigned里面会是一个超级大的正数，全1每一位都是有效的


//7. 
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

//8.
//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}
//unsigned char i的范围是0-255



//浮点数存储的例子
int main()
{
	int n = 9;
	//00000000000000000000000000001001
	//(-1)^0 * 0.
	float *pFloat = (float*)&n;
	printf("n的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);
	//0 00000000 00000000000000000001001
	//E为全0
	//E=-126
	//M=0.00000000000000000001001
	//S=0
	//(-1)^0 * 0.00000000000000000001001 * 2^(-126)
	*pFloat = 9.0;
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//S=0
	//M=1.001
	//E=3  +127
	//0 10000010 00100000000000000000000
	printf("num的值为：%d\n", n);
	//01000001000100000000000000000000-1091567616
	printf("*pFloat的值为：%f\n", *pFloat);
	return 0;
}